#+TITLE: Taris' Doom Emacs Config
#+AUTHOR: Taylor Shin
#+STARTUP: showeverything
#+PROPERTY: header-args :tangle-mode

*** Bash
#+NAME: env_var_homebrew
#+begin_src shell :tangle my_settings_bash
HBREW_PATH="$HOME/.local"
if [ -d "${HBREW_PATH}" ]; then
	export HOMEBREW="${HBREW_PATH}"
	printf "${check_symbol} HOMEBREW directory is ${HOMEBREW}\n"
	sleep ${line_delay}
	export PATH="$HOMEBREW/bin:$PATH"
	export PATH="$HOMEBREW/.opt/bin:$PATH"
	if [ ! -d "${HOMEBREW}" ]; then
		mkdir -p "${HOMEBREW}"
	fi
	if [ ! -d "${HOMEBREW}/bin" ]; then
		mkdir -p "${HOMEBREW}/bin"
	fi
	if [ ! -d "${HOMEBREW}/.opt" ]; then
		mkdir -p "${HOMEBREW}/.opt"
	fi
fi
#+end_src

#+RESULTS: env_var_homebrew
: HOMEBREW directory is /home/taris/.local

